# NumSObj

## Description
Function NumSObj returns the number of selected objects on the referenced layer.

```pascal
FUNCTION NumSObj(h : HANDLE): LONGINT;
```

```python
def vs.NumSObj(h):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to layer.|

## Version
Availability: from All Versions

## Category
* Selection